
# функция для прорисовки висилицы
def display_hangman(tries):
    stages = [
        '''

                  вы повесили человечка(((
                      ----------
                      |        |
                      |        O __-- ххх
                      |       \\|/
                      |        |
                      |       / \\
                      |
                      |_
        ''',
        '''
                      ----------
                      |        |
                      |        O __-- помогите
                      |       \\|/
                      |        |
                      |       /
                      |
                      |_
        ''',
        '''
                      ----------
                      |        |
                      |        O __-- прошу не надо
                      |       \\|/
                      |        |
                      |
                      |
                      |_
        ''',
        '''
                      ----------
                      |        |
                      |        O __-- ааааа
                      |       \\|
                      |        |
                      |
                      |
                      |_
        ''',
        '''

          уже есть голова и туловище, повнимательней
                      ----------
                      |        |
                      |        O __-- где я?
                      |        |
                      |        |
                      |
                      |
                      |_
        ''',
        '''
                      ----------
                      |        |
                      |        O
                      |
                      |
                      |
                      |
                      |_
        ''',
        '''

                   пустая виселица
                      ----------
                      |        |
                      |
                      |
                      |
                      |
                      |
                      |_
        '''
    ]
    return stages[tries]